# StructuralElementDefinitionData Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralElementDefinitionData Constructor
StructuralElementDefinitionData Class See Also
---
Creates empty StructuralElementDefinitionData object.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public StructuralElementDefinitionData()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
StructuralElementDefinitionData()
```

# See Also
StructuralElementDefinitionData Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace